@component('home.teacher.content',['title'=>' تنظیمات '])

<div class="popup not-fixeds">
    <div class="popup-container user-set-pop">
        <div class="user-set-pop-content disbm">
            <ul class="tabv">
                <li class="tabv active">

                    <div class="form">
                        @if($errors->any())
                        <div class="e_section" id="e_section">
                            {!! implode('', $errors->all('<span class="text text-danger">:message</span><br>')) !!}
                        </div>
                    @endif
                            <form id="port_form"  class="mwidth pt0" action="{{route('teacher.save.port',$user->id)}}" method="post" enctype="multipart/form-data">
                                @csrf
                                @method('post')
                            <div class="video-cover-upload">
                                <h2>
                                    عکس و ویدئو را انتخاب و سپس دکمه ذخیره را کلیک کنید
                                </h2>
                                <div class="right">

                                    <h3>
                                        <span>تصویر شاخص</span>
                                        <span class="gray">(عکس کاور ویدیو را آپلود کنید)</span>
                                        <span class="gray" id="cname"></span>

                                    </h3>
                                </div>
                                <div class="left">
                                    <div class="button">
                                        <input type="file" id="video-cover" accept="image/*" name="port_img">
                                        <label for="video-cover" class="back">  انتخاب فایل </label>
                                    </div>
                                </div>
                            </div>

                            <div class="video-upload">
                                <div class="title">
                                    <h3>
                                        آپلود ویدیوی معرفی
                                        <span class="small">(با آپلود ویدئو معرفی، دانشجویان بیشتری را به خود جذب کنید)</span>
                                    </h3>
                                </div>

                                <div class="video-upload-box">
                                    <input type="file" accept="video/mp4" id="video-upload" name="port_vid">
                                    <label for="video-upload">
                                        <div class="right">
                                            <div class="icond">
                                        <span class="icon">
                                            <svg width="62" height="50" viewBox="0 0 62 50" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M43.0255 38.2259C40.3665 38.2259 37.6845 38.1979 35.0255 38.2259C34.7623 38.2196 34.5116 38.1122 34.3255 37.926C34.1393 37.7398 34.0319 37.4891 34.0255 37.2259C34.0535 35.5769 34.3615 36.2259 36.0255 36.2259C40.7605 36.2259 45.2905 36.2399 50.0255 36.2259C55.2255 36.2119 59.1395 31.4159 59.0255 26.2259C59.0028 24.4286 58.4093 22.685 57.3308 21.247C56.2523 19.809 54.7446 18.751 53.0255 18.2259C52.7816 18.1702 52.5584 18.0469 52.3815 17.87C52.2046 17.6931 52.0812 17.4698 52.0255 17.2259C51.8462 15.9703 51.4167 14.7635 50.7626 13.6769C50.1084 12.5903 49.2428 11.6461 48.217 10.9001C47.1913 10.1541 46.0263 9.62155 44.791 9.33398C43.5557 9.0464 42.2753 9.00965 41.0255 9.22591C39.2765 9.48191 37.4335 9.15991 36.0255 10.2259C35.5985 10.5389 35.1965 10.6529 35.0255 10.2259C32.8355 4.87991 27.8125 2.15491 22.0255 2.22591C18.7747 2.31864 15.6674 3.58493 13.2777 5.79078C10.8881 7.99662 9.37762 10.9929 9.02554 14.2259C8.86203 15.2192 8.86203 16.2326 9.02554 17.2259C9.11054 17.6949 9.42554 18.0979 9.02554 18.2259C7.07235 18.8198 5.35089 20.0038 4.09754 21.6152C2.84419 23.2267 2.12039 25.1866 2.02554 27.2259C2.03083 29.6112 2.98073 31.8974 4.66742 33.584C6.3541 35.2707 8.64022 36.2206 11.0255 36.2259C16.1015 36.2539 20.9495 36.2539 26.0255 36.2259C26.1612 36.2074 26.2993 36.2205 26.4291 36.2642C26.5589 36.3079 26.6768 36.381 26.7736 36.4778C26.8704 36.5747 26.9436 36.6926 26.9873 36.8223C27.031 36.9521 27.0441 37.0902 27.0255 37.2259C26.9825 38.6909 27.5045 38.2259 26.0255 38.2259H12.0255C5.25754 38.2259 -0.429457 32.9659 0.0255431 26.2259C0.309543 21.9889 2.25754 19.2169 6.02554 17.2259C6.43754 17.0129 7.02554 16.7089 7.02554 16.2259C7.01154 8.07891 12.0345 1.67591 20.0255 0.22591C23.0846 -0.295216 26.2292 0.0898269 29.0722 1.33361C31.9151 2.57739 34.3321 4.62559 36.0255 7.22591C36.4095 7.82591 36.3575 7.49591 37.0255 7.22591C44.0065 4.43891 52.0495 8.94591 54.0255 16.2259C54.1395 16.6669 54.5985 16.0129 55.0255 16.2259C59.4045 18.3159 61.6085 23.6329 61.0255 28.2259C60.3715 33.3869 56.9875 37.2729 52.0255 38.2259C51.0284 38.3326 50.0227 38.3326 49.0255 38.2259C47.0345 38.2119 45.0155 38.2259 43.0255 38.2259Z" fill="#CDD5DE"/>
                                                <path d="M30.025 24.2259C27.65 26.6149 25.215 28.9789 23.025 31.2259C22.584 31.6669 22.48 31.7259 22.025 31.2259C20.902 30.0169 20.873 30.3779 22.025 29.2259C24.883 26.3679 27.167 23.1119 30.025 20.2259C30.38 19.8709 30.598 19.7989 31.025 20.2259C34.125 23.3679 37.897 27.1259 41.025 30.2259C41.366 30.5669 41.425 29.8989 41.025 30.2259C40.57 30.5959 39.537 32.2259 39.025 32.2259C38.513 32.2259 38.437 30.6379 38.025 30.2259C36.191 28.4059 34.845 27.0459 33.025 25.2259L32.025 24.2259C31.825 24.4959 32.025 24.9839 32.025 25.2259C32.025 32.9889 31.997 41.4629 32.025 49.2259C32.025 49.8659 31.679 49.2539 31.025 49.2259C29.546 49.1829 30.025 49.6909 30.025 48.2259V25.2259C29.997 25.0269 30.025 24.7099 30.025 24.2259Z" fill="#CDD5DE"/>
                                            </svg>
                                        </span>
                                                <span class="text">
                                            آپلود ویدیو معرفی
                                        </span>
                                            </div>
                                            <ul class="circle">
                                                <li>حجم ویدئو حداکثر 20 مگابایت باشد</li>
                                                <li>‏فرمت قابل قبول : MP4 </li>
                                            </ul>
                                        </div>
                                        <div class="left">
                                            <div class="button">
                                                <div class="send">انتخاب فایل</div>
                                            </div>
                                        </div>
                                    </label>
                                </div>

                                <div class="link-title">
                                    <span>آپلود از طریق لینک</span>
                                </div>

                                <div class="input-container icon">
                                    <i class="right-bg">
                                        <svg width="22" height="22" viewBox="0 0 22 22" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M6.58673 0.304718C4.95837 0.263265 3.47419 1.36682 3.09356 3.01663L2.53888 5.41898C4.08588 2.89698 6.74867 1.23327 9.69317 0.948273L7.29083 0.393585C7.05514 0.339148 6.81935 0.31064 6.58673 0.304718ZM10.8074 2.50003C7.18467 2.58063 3.88029 4.99044 2.82892 8.65726C1.53492 13.1703 4.14454 17.8769 8.65704 19.1709C13.1695 20.4649 17.8767 17.8558 19.1707 13.3428C20.4647 8.8298 17.8556 4.12313 13.3426 2.82913C12.4964 2.58651 11.6435 2.48143 10.8074 2.50003ZM16.5809 2.53909C19.1029 4.08609 20.7666 6.74889 21.0516 9.69339L21.6063 7.29105C22.0418 5.40555 20.8687 3.52878 18.9832 3.09378L16.5809 2.53909ZM9.09552 5.29495C9.22794 5.3052 9.36133 5.32922 9.49395 5.36722C10.5555 5.67122 11.169 6.77837 10.865 7.83987C10.561 8.90137 9.45292 9.51497 8.39142 9.21097C7.32992 8.90697 6.7168 7.79981 7.0213 6.73831C7.28774 5.8095 8.16858 5.22324 9.09552 5.29495ZM14.8631 6.94925C14.9956 6.95953 15.1288 6.98345 15.2615 7.02151C16.323 7.32551 16.9371 8.43267 16.6326 9.49417C16.3286 10.5552 15.2205 11.1693 14.159 10.8653C13.0975 10.5613 12.4839 9.45411 12.7879 8.39261C13.0539 7.4638 13.9358 6.87729 14.8631 6.94925ZM11.0174 10.001C11.5694 10.0105 12.0083 10.4651 11.9988 11.0176C11.9893 11.5696 11.5347 12.0086 10.9822 11.9991C10.4302 11.9896 9.99129 11.535 10.0008 10.9825C10.0103 10.4305 10.4649 9.99151 11.0174 10.001ZM7.4422 11.0635C7.57466 11.0738 7.70795 11.0968 7.84063 11.1348C8.90213 11.4388 9.51623 12.5469 9.21173 13.6084C8.90723 14.6699 7.79909 15.283 6.73809 14.9785C5.67659 14.6745 5.0625 13.5674 5.367 12.5059C5.633 11.5771 6.51494 10.9918 7.4422 11.0635ZM0.948056 12.3076L0.393368 14.71C-0.0416316 16.5955 1.13092 18.4718 3.01642 18.9073L5.41876 19.4619C2.89726 17.9149 1.23306 15.2521 0.948056 12.3076ZM13.2088 12.7168C13.3413 12.7271 13.4755 12.7511 13.6082 12.7891C14.6697 13.0931 15.2828 14.2002 14.9783 15.2617C14.6738 16.3232 13.5672 16.9368 12.5057 16.6328C11.4442 16.3288 10.8306 15.2217 11.1346 14.1602C11.4006 13.2314 12.2815 12.6451 13.2088 12.7168ZM19.4617 16.5811C17.9147 19.1026 15.2519 20.7668 12.3074 21.0518L14.7098 21.6065C16.5953 22.0415 18.4715 20.8689 18.907 18.9834L19.4617 16.5811Z" fill="#8895BA"/>
                                        </svg>
                                    </i>
                                    <span>لینک ویدیو در آپارات</span>
                                    <input type="text" name="aparat_link">
                                </div>
                                <div class="button">
                                    @if($user->attr('port_vid'))
                                    <a href="#" class="more" id="classtut">مشاهده ویدئو من </a>
                                    @endif
                                    <button class="send">ذخیره   </button>
                                </div>
                            </div>


                            <div class="instruction">
                                <h3>دستور العمل ضبط ویدئو معرفی</h3>

                                <div class="about-text" style="max-height: 120px;">
                                    <div>
                                        <p>
                                            یکی از موارد مهم و تاثیر گذار در معرفی شما و انتخاب شما توسط زبان آموزان به عنوان مدرس، ویدیو معرفی است بنابراین این مورد را با حساسیت بیشتر انجام دهید تا به نتیجه مطلوب تری برسید.
                                            در این مقاله می پردازیم به اینکه "یک ویدیو معرفی چه ویژگی ها و استاندارد هایی باید داشته باشد" تا شما اساتید بتوانید ویدیو با کیفیت در پروفایلتان آپلود کنید.
                                            بهتر است زمان ویدیو طولانی یا کوتاه نباشد؛ حدود 1 تا 2 دقیقه مناسب تر است. نهایت حجم ویدیو 20 مگابایت است در صورتی که حجم ویدیو شما بیش از حد تعیین شده می باشد با نرم افزار HandBrake حجم ویدو را بدون افت کیفیت کاهش دهید. ویدیو باید با دوربین مناسب ضبط و فیلمبرداری شود. برای ضبط ویدیو حتی می تواند از وبکم کامپیوتر، تلفن همراه و ... که دارای دوربین با رزولوشن بالا هستند، استفاده کنید در این روش ها ضبط ویدیو به صورت افقی مناسب تر است. همچنین توجه داشته باشید که صدای شما رسا و با کیفیت عالی می باشد. دوربین ثابت و بدون لرزش باشد و فاصله خود با دوربین را تنظیم کنید تا بیش از حد نزدیک یا دور نباشید.
                                            در مکانی که درای پس زمینه ساده و مرتب است ویدیو را ضبط کنید. دقت داشته باشید که هنگام فیلمبرداری محیط آرام، بدون صداهای پس زمینه و آزار دهنده (صدای گریه کودک، بوق خودرو، صدای تلویزیون و ...) باشد.
                                        </p>
                                    </div>
                                </div>

                                <div class="about-more">
                                    <div>

                                <span class="down">
                                    <svg width="8" height="5" viewBox="0 0 8 5" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M4.01206 2.89392L6.23406 0.354919C6.27833 0.300743 6.33409 0.257085 6.3973 0.227105C6.46051 0.197125 6.5296 0.181572 6.59956 0.181572C6.66952 0.181572 6.73861 0.197125 6.80182 0.227105C6.86504 0.257085 6.92079 0.300743 6.96506 0.354919C7.06284 0.472267 7.11638 0.620177 7.11638 0.772919C7.11638 0.925661 7.06284 1.07357 6.96506 1.19092L4.38006 4.14892C4.33579 4.20309 4.28004 4.24675 4.21682 4.27673C4.15361 4.30671 4.08452 4.32227 4.01456 4.32227C3.9446 4.32227 3.87551 4.30671 3.8123 4.27673C3.74909 4.24675 3.69333 4.20309 3.64906 4.14892L1.06306 1.19192C0.965287 1.07457 0.911743 0.926661 0.911743 0.773919C0.911743 0.621176 0.965287 0.473267 1.06306 0.355919C1.10733 0.301743 1.16309 0.258085 1.2263 0.228105C1.28951 0.198125 1.3586 0.182572 1.42856 0.182572C1.49852 0.182572 1.56761 0.198125 1.63082 0.228105C1.69404 0.258085 1.74979 0.301743 1.79406 0.355919L4.01206 2.89392Z" fill="currentColor"></path>
                                    </svg>
                                </span>
                                        <span>مشاهده بیشتر</span>
                                    </div>
                                </div>
                            </div>

                            <div class="videos">
                                <h3>تعدادی از ویدیو های مناسب</h3>
                                <p>ویدیو های زیر مورد تایید سایت میباشد میتوانید برای ساخت ویدیو خود از این ویدیو ها الگو بگیرید </p>
                                <div class="row">
                                    <div class="col-lg-6 col-md-12">

                                        <div>
                                            <div class="video">

                                                <video id="player" class="js-player" playsinline controls data-poster="{{asset('/src/port_img/89_port_vid.m4v' )}}">
                                                    <source src="{{asset('/src/port_vid/s2.mp4')}}" type="video/mp4" />
                                                </video>
                                            </div>
                                        </div>
                                    </div>
                                    <div class="col-lg-6 col-md-12">
                                        <div>
                                            <div class="video">
                                                <video id="player" class="js-player" playsinline controls data-poster="/path/to/poster.jpg">
                                                    <source src="{{asset('/src/port_vid/s1.mp4')}}" type="video/mp4" />

                                                </video>
                                            </div>
                                        </div>
                                    </div>
                                </div>
                            </div>
                        </form>
                    </div>
                </li>
            </ul>
        </div>

    </div>
</div>


<div class="popup popupc" id="classtut_pop">
    <div>
        <div>
            <div>
                <div class="popup-container user-set-pop" >
                    <span class="close">
                        <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M5.99999 4.58599L10.243 0.342987C10.6335 -0.0474781 11.2665 -0.0474791 11.657 0.342986C12.0475 0.733452 12.0475 1.36652 11.657 1.75699L7.41399 5.99999L11.657 10.243C12.0475 10.6335 12.0475 11.2665 11.657 11.657C11.2665 12.0475 10.6335 12.0475 10.243 11.657L5.99999 7.41399L1.75699 11.657C1.36652 12.0475 0.733452 12.0475 0.342986 11.657C-0.0474791 11.2665 -0.0474789 10.6335 0.342987 10.243L4.58599 5.99999L0.342987 1.75699C-0.0474782 1.36652 -0.0474791 0.733452 0.342986 0.342986C0.733452 -0.0474791 1.36652 -0.0474789 1.75699 0.342987L5.99999 4.58599Z" fill="currentColor"/>
                        </svg>
                    </span>

                    <div class="video">
                        <video id="player" class="js-player" playsinline controls  data-poster="{{asset('/src/port_img/'.$user->attr('port_img'))}}">
                            <source src="{{asset('/src/port_vid/'.$user->attr('port_vid'))}}" type="video/mp4" />

                        </video>

                    </div>

                </div>
            </div>
        </div>
    </div>
</div>


@endcomponent
